

var rule = {
            title: '乱伦群视频',
            host: 'https://wap.llq37.cc',
            timeout:15000,
            url: '/llq/index.php/vod/show/by/fyfilter/id/fyclass/page/fypage.html',
            searchUrl: '/llq/index.php/vod/search/page/fypage/wd/**.html',
            searchable: 2,//是否启用全局搜索,
            quickSearch: 1,//是否启用快速搜索,
            filterable: 0,//是否启用分类筛选,
            headers: { 'User-Agent': "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/136.0.0.0 Safari/537.36 Edg/136.0.0.0"},//网站的请求头,完整支持所有的,常带ua和cookies
            class_url: '86&191&221&267&117&308&tag',      //'choice&film&movie&tv&variety&cartoon&child&mini_drama&mid_video'
    			 class_name: '奥斯卡资源&仓房资源&155资源&乱伦资源&森林资源&玉兔资源&热搜推荐',
            //class_parse: '.wap-show0&&ul&&li0;a&&Text;a&&href;.*/(\\d+)-----------.html',//a&&href  a&&Text .wap-show0&&ul&&li0
            cate_exclude: '',
            filter_url: '{{fl.class}}_{{fl.sort or "time"}}_{{fl.tag1 or fl.tag2 or fl.tag3 or fl.tag4 or fl.tag5 or fl.tag6 or fl.tag7 or fl.tag8}}',
            filter: {'117': [{'key': 'class', 'name': '类型', 'value': [{'n': '全部', 'v': ''}, {'n': '精品推荐', 'v': '118'}, {'n': '国产色情', 'v': '119'}, {'n': '主播直播', 'v': '120'}, {'n': '伦理三级', 'v': '121'}, {'n': '自拍偷拍', 'v': '122'}, {'n': '素人自拍', 'v': '123'}, {'n': '唯美港姐', 'v': '124'}, {'n': '剧情介绍', 'v': '125'}, {'n': '91探花', 'v': '126'}, {'n': '网红流出', 'v': '127'}, {'n': '野外露出', 'v': '128'}, {'n': '古装扮演', 'v': '129'}, {'n': '可爱学生', 'v': '130'}, {'n': '风情旗袍', 'v': '131'}, {'n': '瑜伽裤', 'v': '132'}, {'n': '网曝门', 'v': '133'}, {'n': '传媒出品', 'v': '134'}, {'n': '亚洲无码', 'v': '152'}, {'n': '亚洲有码', 'v': '153'}, {'n': '中文字幕', 'v': '154'}]}, {'key': 'sort', 'name': '排序', 'value': [{'n': '排序', 'v': ''}, {'n': '时间', 'v': 'time'}, {'n': '人气', 'v': 'hits'}, {'n': '评分', 'v': 'score'}]}], '191': [{'key': 'class', 'name': '类型', 'value': [{'n': '全部', 'v': ''}, {'n': '日本有码', 'v': '196'}, {'n': '无码中文字幕', 'v': '197'}, {'n': '有码中文字幕', 'v': '198'}, {'n': '日本无码', 'v': '199'}, {'n': '国产视频', 'v': '200'}, {'n': '欧美高清', 'v': '201'}, {'n': '动漫剧情', 'v': '202'}]}, {'key': 'sort', 'name': '排序', 'value': [{'n': '排序', 'v': ''}, {'n': '时间', 'v': 'time'}, {'n': '人气', 'v': 'hits'}, {'n': '评分', 'v': 'score'}]}], '221': [{'key': 'class', 'name': '类型', 'value': [{'n': '全部', 'v': ''}, {'n': 'AV解说', 'v': '243'}, {'n': '女优明星', 'v': '242'}, {'n': '欧美无码', 'v': '241'}, {'n': '网曝黑料', 'v': '240'}, {'n': '网红头条', 'v': '239'}, {'n': '抖音视频', 'v': '237'}, {'n': '强歼乱伦', 'v': '236'}, {'n': '美乳巨乳', 'v': '235'}, {'n': '百合剧情', 'v': '234'}, {'n': '萝莉少女', 'v': '233'}, {'n': '熟女人妻', 'v': '232'}, {'n': '国产自拍', 'v': '231'}, {'n': '美女主播', 'v': '230'}, {'n': '欧美系列', 'v': '229'}, {'n': '卡通动漫', 'v': '228'}, {'n': '韩国主播', 'v': '238'}, {'n': '中文字幕', 'v': '227'}, {'n': 'AI换脸', 'v': '226'}, {'n': '三级伦理', 'v': '225'}, {'n': '制服诱惑', 'v': '224'}]}, {'key': 'sort', 'name': '排序', 'value': [{'n': '排序', 'v': ''}, {'n': '时间', 'v': 'time'}, {'n': '人气', 'v': 'hits'}, {'n': '评分', 'v': 'score'}]}], '267': [{'key': 'class', 'name': '类型', 'value': [{'n': '全部', 'v': ''}, {'n': '高清有码', 'v': '279'}, {'n': '动漫精选', 'v': '278'}, {'n': '学生妹', 'v': '277'}, {'n': '中文字幕', 'v': '275'}, {'n': '高清无码', 'v': '274'}, {'n': '黑料网曝', 'v': '273'}, {'n': '主播网红', 'v': '272'}, {'n': '乱伦系列', 'v': '271'}, {'n': '国产大制作', 'v': '270'}, {'n': '偷拍自拍', 'v': '269'}, {'n': '欧美精品', 'v': '268'}]}, {'key': 'sort', 'name': '排序', 'value': [{'n': '排序', 'v': ''}, {'n': '时间', 'v': 'time'}, {'n': '人气', 'v': 'hits'}, {'n': '评分', 'v': 'score'}]}], '308': [{'key': 'class', 'name': '类型', 'value': [{'n': '全部', 'v': ''}, {'n': '探花嫖娼', 'v': '336'}, {'n': '同性恋', 'v': '337'}, {'n': '国产人妻', 'v': '333'}, {'n': '国产SM', 'v': '332'}, {'n': '国产丝袜', 'v': '331'}, {'n': '国产乱伦', 'v': '330'}, {'n': '明星换脸', 'v': '329'}, {'n': '麻豆传媒', 'v': '326'}, {'n': '网曝系列', 'v': '325'}, {'n': '剧情介绍', 'v': '324'}, {'n': '日本片商', 'v': '323'}, {'n': '自拍偷拍', 'v': '322'}, {'n': '丝袜OL', 'v': '321'}, {'n': '卡通动漫', 'v': '320'}, {'n': '三级伦理', 'v': '319'}, {'n': '欧美情色', 'v': '318'}, {'n': '强歼乱伦', 'v': '317'}, {'n': '性感人妻', 'v': '316'}, {'n': '童颜巨乳', 'v': '315'}, {'n': '中文字幕', 'v': '314'}]}, {'key': 'sort', 'name': '排序', 'value': [{'n': '排序', 'v': ''}, {'n': '时间', 'v': 'time'}, {'n': '人气', 'v': 'hits'}, {'n': '评分', 'v': 'score'}]}], '86': [{'key': 'class', 'name': '类型', 'value': [{'n': '全部', 'v': ''}, {'n': '网红头条', 'v': '94'}, {'n': '伦理三级', 'v': '93'}, {'n': '网曝黑料', 'v': '92'}, {'n': '国产视频', 'v': '88'}, {'n': '国产传媒', 'v': '89'}, {'n': '国产主播', 'v': '90'}, {'n': '抖阴视频', 'v': '91'}, {'n': '中文字幕', 'v': '181'}, {'n': '日本有码', 'v': '182'}, {'n': '日本无码', 'v': '183'}, {'n': '强奸乱伦', 'v': '184'}, {'n': '制服诱惑', 'v': '185'}, {'n': '激情动漫', 'v': '186'}, {'n': '明星换脸', 'v': '187'}, {'n': '女优明星', 'v': '188'}, {'n': '极品媚黑', 'v': '189'}, {'n': '韩国主播', 'v': '190'}]}, {'key': 'sort', 'name': '排序', 'value': [{'n': '排序', 'v': ''}, {'n': '时间', 'v': 'time'}, {'n': '人气', 'v': 'hits'}, {'n': '评分', 'v': 'score'}]}], 'tag': [{'key': 'tag1', 'name': '链接1', 'value': [{'n': '女儿', 'v': '女儿'}, {'n': '乱伦', 'v': '乱伦'}, {'n': '黑人', 'v': '黑人'}, {'n': '00后', 'v': '00后'}, {'n': '拍摄', 'v': '拍摄'}, {'n': '国语', 'v': '国语'}, {'n': '酒店', 'v': '酒店'}, {'n': '粉nen', 'v': '粉nen'}, {'n': '表妹', 'v': '表妹'}, {'n': '内内', 'v': '内内'}, {'n': '屁屁', 'v': '屁屁'}, {'n': '干醒', 'v': '干醒'}, {'n': '流血', 'v': '流血'}, {'n': '女儿', 'v': '女儿'}, {'n': '撕烂', 'v': '撕烂'}, {'n': '呻吟', 'v': '呻吟'}, {'n': '嫖妓', 'v': '嫖妓'}, {'n': '阿姨', 'v': '阿姨'}, {'n': '调教', 'v': '调教'}, {'n': '美国', 'v': '美国'}]}, {'key': 'tag2', 'name': '链接2', 'value': [{'n': 'A片', 'v': 'A片'}, {'n': '虐待', 'v': '虐待'}, {'n': '校园', 'v': '校园'}, {'n': '调教', 'v': '调教'}, {'n': '教师', 'v': '教师'}, {'n': '高中', 'v': '高中'}, {'n': '变态', 'v': '变态'}, {'n': '挤奶', 'v': '挤奶'}, {'n': '影星', 'v': '影星'}, {'n': '高潮', 'v': '高潮'}, {'n': '更衣', 'v': '更衣'}, {'n': '不雅', 'v': '不雅'}, {'n': '白丝', 'v': '白丝'}, {'n': '厕所', 'v': '厕所'}, {'n': '强上', 'v': '强上'}, {'n': '插入', 'v': '插入'}, {'n': '萝莉', 'v': '萝莉'}, {'n': '大', 'v': '大'}, {'n': '高中', 'v': '高中'}, {'n': '野外', 'v': '野外'}]}, {'key': 'tag3', 'name': '链接3', 'value': [{'n': '丰满', 'v': '丰满'}, {'n': '火辣', 'v': '火辣'}, {'n': '约战', 'v': '约战'}, {'n': '网红', 'v': '网红'}, {'n': '女儿', 'v': '女儿'}, {'n': '瑜伽', 'v': '瑜伽'}, {'n': '尾随', 'v': '尾随'}, {'n': '狗链', 'v': '狗链'}, {'n': '拍摄', 'v': '拍摄'}, {'n': '女友', 'v': '女友'}, {'n': '古装', 'v': '古装'}, {'n': '新婚', 'v': '新婚'}, {'n': '商场', 'v': '商场'}, {'n': '拍摄', 'v': '拍摄'}, {'n': '酒店', 'v': '酒店'}, {'n': '体育', 'v': '体育'}, {'n': '粉nen', 'v': '粉nen'}, {'n': '肉丝', 'v': '肉丝'}, {'n': '圣诞', 'v': '圣诞'}, {'n': '野性', 'v': '野性'}]}, {'key': 'tag4', 'name': '链接4', 'value': [{'n': '姐姐', 'v': '姐姐'}, {'n': '皮鞭', 'v': '皮鞭'}, {'n': '勾引', 'v': '勾引'}, {'n': '和服', 'v': '和服'}, {'n': '女模', 'v': '女模'}, {'n': '00后', 'v': '00后'}, {'n': '学生', 'v': '学生'}, {'n': '少妇', 'v': '少妇'}, {'n': '绳子', 'v': '绳子'}, {'n': '百合', 'v': '百合'}, {'n': '木耳', 'v': '木耳'}, {'n': '女儿', 'v': '女儿'}, {'n': '黑丝', 'v': '黑丝'}, {'n': '丰满', 'v': '丰满'}, {'n': '宾馆', 'v': '宾馆'}, {'n': '大姐', 'v': '大姐'}, {'n': '良家', 'v': '良家'}, {'n': '纹身', 'v': '纹身'}, {'n': '女模', 'v': '女模'}, {'n': '校园', 'v': '校园'}]}, {'key': 'tag5', 'name': '链接5', 'value': [{'n': '强迫', 'v': '强迫'}, {'n': '绝世', 'v': '绝世'}, {'n': '特色', 'v': '特色'}, {'n': '快手', 'v': '快手'}, {'n': '野鸡', 'v': '野鸡'}, {'n': '长裙', 'v': '长裙'}, {'n': '大姐', 'v': '大姐'}, {'n': '影星', 'v': '影星'}, {'n': '按摩', 'v': '按摩'}, {'n': '流血', 'v': '流血'}, {'n': '温柔', 'v': '温柔'}, {'n': '长裙', 'v': '长裙'}, {'n': '啪啪', 'v': '啪啪'}, {'n': '拍摄', 'v': '拍摄'}, {'n': '骚女', 'v': '骚女'}, {'n': '粉穴', 'v': '粉穴'}, {'n': 'SM', 'v': 'SM'}, {'n': '销魂', 'v': '销魂'}, {'n': '粉鲍', 'v': '粉鲍'}, {'n': '粉丝', 'v': '粉丝'}]}, {'key': 'tag6', 'name': '链接6', 'value': [{'n': '破处', 'v': '破处'}, {'n': '调教', 'v': '调教'}, {'n': '撕烂', 'v': '撕烂'}, {'n': '私教', 'v': '私教'}, {'n': '抖音', 'v': '抖音'}, {'n': '少妇', 'v': '少妇'}, {'n': '呻吟', 'v': '呻吟'}, {'n': 'Paco', 'v': 'Paco'}, {'n': '前后', 'v': '前后'}, {'n': '白屁股', 'v': '白屁股'}, {'n': '网红', 'v': '网红'}, {'n': '强迫', 'v': '强迫'}, {'n': '哥哥', 'v': '哥哥'}, {'n': '催眠', 'v': '催眠'}]}]},
            filter_def:{},
            play_parse: true,
            lazy: '',
            limit: 6,
            推荐:'',
            double: true, // 推荐内容是否双层定位
            一级:`js:
						let d = [];
						let html;
						let pdfh = jsp.pdfh;
						let pdfa = jsp.pdfa;
						let pd = jsp.pd;
						print(input)
						if(/show/.test(input)){ let ids = input.match(/by\\/(.*)\\/id/)[1].split("_"); if(ids[0]){ input = input.replace(/id\\/.*\\/page/, "id/" + ids[0] + "/page"); }; print(ids);
							if(ids[2]){ input = input.replace(/vod.*/,"vod/search/page/" + MY_PAGE + "/wd/" + ids[2] + ".html") }else{ input = input.replace(/by\\/(.*)\\/id/,"by/" + ids[1] + "/id");}  }
						print(input)
						html =  request(input);
						//print(html)
						let items = pdfa(html,'.stui-vodlist.clearfix&&li')
						print(items)
						for(let i = 0; i < items.length; i++){
							d.push({
								title: pd(items[i],'h4&&a&&title'),
								desc: pdfh(items[i],'.pic-text-top&&Text') + "     " + pdfh(items[i],'.pic-text&&Text') ,
								pic_url: pd(items[i],'.stui-vodlist__box&&a&&data-original'),
								url: pd(items[i],'h4&&a&&href')
							})
						}
						setResult(d)
						`,
            二级:`js:
						let pdfh = jsp.pdfh;
						let pdfa = jsp.pdfa;
						let pd = jsp.pd;
						let play_froms = [];
						let play_urls = [];
						let html =  request(input); 
						let url = pd(html,'.play-btn&&a&&href');
						let _html = request(url); 
						let froms = pdfa(_html,'.tab-top.play-tab.clearfix&&li');
						let urls = pdfa(_html,'.play-content&&.play-item');
						print(urls)
						for(let i = 0; i < froms.length; i++){
							play_froms.push(pdfh(froms[i],'a&&Text')); 
							play_urls.push("第一集$" + pd(urls[i],'ul&&li&&a&&href'))
						}
						//print(play_froms)
						print(play_urls)
						VOD = {
							vod_id: '',
							vod_name:  "",
							vod_pic: '',
							type_name: "",
							vod_year: '',
							vod_area: '',
							vod_remarks: '',
							vod_actor:  '',
							vod_director: '',
							vod_content: '',
							vod_play_from: play_froms.join("$$$"),
							vod_play_url: play_urls.join("$$$")
						};


						`,

            搜索:'*'
        }